Revit 2026 API

# TemperatureRatingTypeSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual TemperatureRatingTypeSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As TemperatureRatingTypeSetIterator
```
```cpp
public:
virtual TemperatureRatingTypeSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> TemperatureRatingTypeSetIterator
override ForwardIterator : unit -> TemperatureRatingTypeSetIterator
```

#### Return Value

TemperatureRatingTypeSetIteratorReturns a forward moving iterator to the set.

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace